RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_pwm.c
void PWM_Channelx_Threshold_Set(PWMx_ID_Type id, PWM_CHx_Type ch, uint16_t thresholdL, uint16_t thresholdH)
{
    uint32_t tmpVal;
    /* Get PWMx start register address */
    uint32_t PWMx = PWMx_Get_Reg_Addr(id);

    /* Check the parameters */
    CHECK_PARAM(IS_PWMx_ID_TYPE(id));
    CHECK_PARAM(IS_PWM_CHx_TYPE(ch));

    switch (ch) {
        case PWM_CH0:
            tmpVal = BL_RD_REG(PWMx, PWM_CH0_THRE);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH0_THREL, thresholdL);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH0_THREH, thresholdH);
            BL_WR_REG(PWMx, PWM_CH0_THRE, tmpVal);
            break;
        case PWM_CH1:
            tmpVal = BL_RD_REG(PWMx, PWM_CH1_THRE);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH1_THREL, thresholdL);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH1_THREH, thresholdH);
            BL_WR_REG(PWMx, PWM_CH1_THRE, tmpVal);
            break;
        case PWM_CH2:
            tmpVal = BL_RD_REG(PWMx, PWM_CH2_THRE);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH2_THREL, thresholdL);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH2_THREH, thresholdH);
            BL_WR_REG(PWMx, PWM_CH2_THRE, tmpVal);
            break;
        case PWM_CH3:
            tmpVal = BL_RD_REG(PWMx, PWM_CH3_THRE);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH3_THREL, thresholdL);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH3_THREH, thresholdH);
            BL_WR_REG(PWMx, PWM_CH3_THRE, tmpVal);
            break;
        default:
            break;
    }
}

void PWM_Channelx_ThresholdL_Set(PWMx_ID_Type id, PWM_CHx_Type ch, uint16_t thresholdL)
{
    uint32_t tmpVal;
    /* Get PWMx start register address */
    uint32_t PWMx = PWMx_Get_Reg_Addr(id);

    /* Check the parameters */
    CHECK_PARAM(IS_PWMx_ID_TYPE(id));
    CHECK_PARAM(IS_PWM_CHx_TYPE(ch));

    switch (ch) {
        case PWM_CH0:
            tmpVal = BL_RD_REG(PWMx, PWM_CH0_THRE);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH0_THREL, thresholdL);
            BL_WR_REG(PWMx, PWM_CH0_THRE, tmpVal);
            break;
        case PWM_CH1:
            tmpVal = BL_RD_REG(PWMx, PWM_CH1_THRE);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH1_THREL, thresholdL);
            BL_WR_REG(PWMx, PWM_CH1_THRE, tmpVal);
            break;
        case PWM_CH2:
            tmpVal = BL_RD_REG(PWMx, PWM_CH2_THRE);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH2_THREL, thresholdL);
            BL_WR_REG(PWMx, PWM_CH2_THRE, tmpVal);
            break;
        case PWM_CH3:
            tmpVal = BL_RD_REG(PWMx, PWM_CH3_THRE);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH3_THREL, thresholdL);
            BL_WR_REG(PWMx, PWM_CH3_THRE, tmpVal);
            break;
        default:
            break;
    }
}

void PWM_Channelx_ThresholdH_Set(PWMx_ID_Type id, PWM_CHx_Type ch, uint16_t thresholdH)
{
    uint32_t tmpVal;
    /* Get PWMx start register address */
    uint32_t PWMx = PWMx_Get_Reg_Addr(id);

    /* Check the parameters */
    CHECK_PARAM(IS_PWMx_ID_TYPE(id));
    CHECK_PARAM(IS_PWM_CHx_TYPE(ch));

    switch (ch) {
        case PWM_CH0:
            tmpVal = BL_RD_REG(PWMx, PWM_CH0_THRE);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH0_THREH, thresholdH);
            BL_WR_REG(PWMx, PWM_CH0_THRE, tmpVal);
            break;
        case PWM_CH1:
            tmpVal = BL_RD_REG(PWMx, PWM_CH1_THRE);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH1_THREH, thresholdH);
            BL_WR_REG(PWMx, PWM_CH1_THRE, tmpVal);
            break;
        case PWM_CH2:
            tmpVal = BL_RD_REG(PWMx, PWM_CH2_THRE);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH2_THREH, thresholdH);
            BL_WR_REG(PWMx, PWM_CH2_THRE, tmpVal);
            break;
        case PWM_CH3:
            tmpVal = BL_RD_REG(PWMx, PWM_CH3_THRE);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH3_THREH, thresholdH);
            BL_WR_REG(PWMx, PWM_CH3_THRE, tmpVal);
            break;
        default:
            break;
    }
}

void PWM_Channelx_Threshold_Get(PWMx_ID_Type id, PWM_CHx_Type ch, uint16_t *thresholdL, uint16_t *thresholdH)
{
    uint32_t tmpVal;
    /* Get PWMx start register address */
    uint32_t PWMx = PWMx_Get_Reg_Addr(id);

    /* Check the parameters */
    CHECK_PARAM(IS_PWMx_ID_TYPE(id));
    CHECK_PARAM(IS_PWM_CHx_TYPE(ch));

    /* get pwm thresholdL and thresholdH */
    switch (ch) {
        case PWM_CH0:
            tmpVal = BL_RD_REG(PWMx, PWM_CH0_THRE);
            *thresholdL = BL_GET_REG_BITS_VAL(tmpVal, PWM_CH0_THREL);
            *thresholdH = BL_GET_REG_BITS_VAL(tmpVal, PWM_CH0_THREH);
            break;
        case PWM_CH1:
            tmpVal = BL_RD_REG(PWMx, PWM_CH1_THRE);
            *thresholdL = BL_GET_REG_BITS_VAL(tmpVal, PWM_CH1_THREL);
            *thresholdH = BL_GET_REG_BITS_VAL(tmpVal, PWM_CH1_THREH);
            break;
        case PWM_CH2:
            tmpVal = BL_RD_REG(PWMx, PWM_CH2_THRE);
            *thresholdL = BL_GET_REG_BITS_VAL(tmpVal, PWM_CH2_THREL);
            *thresholdH = BL_GET_REG_BITS_VAL(tmpVal, PWM_CH2_THREH);
            break;
        case PWM_CH3:
            tmpVal = BL_RD_REG(PWMx, PWM_CH3_THRE);
            *thresholdL = BL_GET_REG_BITS_VAL(tmpVal, PWM_CH3_THREL);
            *thresholdH = BL_GET_REG_BITS_VAL(tmpVal, PWM_CH3_THREH);
            break;
        default:
            break;
    }
}

void PWM_Channelx_Pwm_Mode_Set(PWMx_ID_Type id, PWM_CHx_Type ch, PWM_Mode_Type modP, PWM_Mode_Type modN)
{
    uint32_t tmpVal;
    /* Get PWMx start register address */
    uint32_t PWMx = PWMx_Get_Reg_Addr(id);

    /* Check the parameters */
    CHECK_PARAM(IS_PWMx_ID_TYPE(id));
    CHECK_PARAM(IS_PWM_CHx_TYPE(ch));
    CHECK_PARAM(IS_PWM_MODE_TYPE(modP));
    CHECK_PARAM(IS_PWM_MODE_TYPE(modN));

    /* Config pwm config1 */
    tmpVal = BL_RD_REG(PWMx, PWM_CONFIG1);
    switch (ch) {
        case PWM_CH0:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH0_PEN, modP);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH0_NEN, modN);
            break;
        case PWM_CH1:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH1_PEN, modP);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH1_NEN, modN);
            break;
        case PWM_CH2:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH2_PEN, modP);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH2_NEN, modN);
            break;
        case PWM_CH3:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH3_PEN, modP);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH3_NEN, modN);
            break;
        default:
            break;
    }
    BL_WR_REG(PWMx, PWM_CONFIG1, tmpVal);
}
void PWM_Channelx_Positive_Pwm_Mode_Set(PWMx_ID_Type id, PWM_CHx_Type ch, PWM_Mode_Type mod)
{
    uint32_t tmpVal;
    /* Get PWMx start register address */
    uint32_t PWMx = PWMx_Get_Reg_Addr(id);

    /* Check the parameters */
    CHECK_PARAM(IS_PWMx_ID_TYPE(id));
    CHECK_PARAM(IS_PWM_CHx_TYPE(ch));
    CHECK_PARAM(IS_PWM_MODE_TYPE(mod));

    /* Config pwm config1 */
    tmpVal = BL_RD_REG(PWMx, PWM_CONFIG1);
    switch (ch) {
        case PWM_CH0:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH0_PEN, mod);
            break;
        case PWM_CH1:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH1_PEN, mod);
            break;
        case PWM_CH2:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH2_PEN, mod);
            break;
        case PWM_CH3:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH3_PEN, mod);
            break;
        default:
            break;
    }
    BL_WR_REG(PWMx, PWM_CONFIG1, tmpVal);
}
void PWM_Channelx_Negative_Pwm_Mode_Set(PWMx_ID_Type id, PWM_CHx_Type ch, PWM_Mode_Type mod)
{
    uint32_t tmpVal;
    /* Get PWMx start register address */
    uint32_t PWMx = PWMx_Get_Reg_Addr(id);

    /* Check the parameters */
    CHECK_PARAM(IS_PWMx_ID_TYPE(id));
    CHECK_PARAM(IS_PWM_CHx_TYPE(ch));
    CHECK_PARAM(IS_PWM_MODE_TYPE(mod));

    /* Config pwm config1 */
    tmpVal = BL_RD_REG(PWMx, PWM_CONFIG1);
    switch (ch) {
        case PWM_CH0:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH0_NEN, mod);
            break;
        case PWM_CH1:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH1_NEN, mod);
            break;
        case PWM_CH2:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH2_NEN, mod);
            break;
        case PWM_CH3:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH3_NEN, mod);
            break;
        default:
            break;
    }
    BL_WR_REG(PWMx, PWM_CONFIG1, tmpVal);
}

void PWM_Channelx_Polarity_Set(PWMx_ID_Type id, PWM_CHx_Type ch, PWM_Polarity_Type polP, PWM_Polarity_Type polN)
{
    uint32_t tmpVal;
    /* Get PWMx start register address */
    uint32_t PWMx = PWMx_Get_Reg_Addr(id);

    /* Check the parameters */
    CHECK_PARAM(IS_PWMx_ID_TYPE(id));
    CHECK_PARAM(IS_PWM_CHx_TYPE(ch));
    CHECK_PARAM(IS_PWM_POLARITY_TYPE(polP));
    CHECK_PARAM(IS_PWM_POLARITY_TYPE(polN));

    /* Config pwm config1 */
    tmpVal = BL_RD_REG(PWMx, PWM_CONFIG1);
    switch (ch) {
        case PWM_CH0:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH0_PPL, polP);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH0_NPL, polN);
            break;
        case PWM_CH1:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH1_PPL, polP);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH1_NPL, polN);
            break;
        case PWM_CH2:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH2_PPL, polP);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH2_NPL, polN);
            break;
        case PWM_CH3:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH3_PPL, polP);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH3_NPL, polN);
            break;
        default:
            break;
    }
    BL_WR_REG(PWMx, PWM_CONFIG1, tmpVal);
}

