RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_pwm.c
    tmpVal = BL_RD_REG(PWMx, PWM_INT_MASK);
    if (intType == PWM_INT_ALL) {
        if (intMask == UNMASK) {
            tmpVal &= ~((1U << PWM_INT_ALL) - 1);
        } else {
            tmpVal |= ((1U << PWM_INT_ALL) - 1);
        }
    } else {
        if (intMask == UNMASK) {
            tmpVal &= ~(1U << intType);
        } else {
            tmpVal |= (1U << intType);
        }
    }
    BL_WR_REG(PWMx, PWM_INT_MASK, tmpVal);
}

void PWM_Int_Clear(PWMx_ID_Type id, PWM_INT_Type intType)
{
    uint32_t tmpVal;
    /* Get PWMx start register address */
    uint32_t PWMx = PWMx_Get_Reg_Addr(id);

    /* Check the parameters */
    CHECK_PARAM(IS_PWMx_ID_TYPE(id));
    CHECK_PARAM(IS_PWM_INT_TYPE(intType));

    tmpVal = BL_RD_REG(PWMx, PWM_INT_CLEAR);

    if (intType == PWM_INT_ALL) {
        tmpVal = ((1U << PWM_INT_ALL) - 1);
    } else {
        tmpVal = (1U << intType);
    }
    BL_WR_REG(PWMx, PWM_INT_CLEAR, tmpVal);
}

BL_Sts_Type PWM_Int_Status_Get(PWMx_ID_Type id, PWM_INT_Type intType)
{
    uint32_t tmpVal;
    /* Get PWMx start register address */
    uint32_t PWMx = PWMx_Get_Reg_Addr(id);

    /* Check the parameters */
    CHECK_PARAM(IS_PWM_CH_ID_TYPE(id));
    CHECK_PARAM(IS_PWM_INT_TYPE(intType));

    tmpVal = BL_RD_REG(PWMx, PWM_INT_STS);

    if (intType == PWM_INT_ALL) {
        if (tmpVal & ((1 << PWM_CHx_MAX) - 1)) {
            return SET;
        } else {
            return RESET;
        }
    } else {
        if (tmpVal & (1 << intType)) {
            return SET;
        } else {
            return RESET;
        }
    }
}

/****************************************************************************/ /**
 * @brief  Install PWM interrupt callback function
 *
 * @param  id: PWM ID
 * @param  intType: PWM interrupt type
 * @param  cbFun: Pointer to interrupt callback function. The type should be void (*fn)(void)
 *
 * @return None
 *
*******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
void PWM_Int_Callback_Install(PWMx_ID_Type id, uint32_t intType, intCallback_Type *cbFun)
{
    PWMIntCbfArra[id][intType] = cbFun;
}
#endif

/****************************************************************************/ /**
 * @brief  PWM interrupt function
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
void PWM_IRQHandler(void)
{
    PWM_IntHandler(PWM_IRQn);
}
#endif

/*@} end of group PWM_Public_Functions */

/*@} end of group PWM */

/*@} end of group BL808_Peripheral_Driver */
